## Assignment 1

### Q1 Pg 7
State: Florida

In [1]:
import pandas as pd
florida=pd.read_csv('all_040_in_12.P1.csv')
print(florida)

   GEOID  SUMLEV  STATE  COUNTY  CBSA  CSA  NECTA  CNECTA     NAME    POP100  \
0     12      40     12     NaN   NaN  NaN    NaN     NaN  Florida  18801310

     HU100  POP100.2000  HU100.2000   P001001  P001001.2000
0  8989580     15982378     7302947  18801310      15982378

### Q2 Pg 9

In [3]:
df = pd.read_excel("Flag_Reference.xls")
print(df.head())

   ID                                        DESCRIPTION
0   3  Data not enumerated, tabulated, or otherwise a...
1   4  Figure withheld to avoid disclosure pertaining...
2   5  Figure not applicable because column heading a...
3   6  Figure does not meet publication standards for...
4   7  Entry would amount to less than half the unit ...

## Assignment 2

### Q1 pg 13

In [6]:
import numpy as np
import glob
all_data = pd.DataFrame()
for f in glob.glob("datasets/weekly_call_data/weekdata*.xlsx"):
    df = pd.read_excel(f)
    all_data = all_data.append(df,ignore_index=True)

print(all_data.head())
print(all_data.shape)

   Unnamed: 0 CallingNumber DayOfWeek TimeOfDay  CallDuration  \
0           0  774-823-8593       thu     10:30            20
1           1  432-403-9821       fri     11:24            10
2           2  274-683-6814       tue     15:43            17
3           3  681-402-6913       tue     13:44             2
4           4  242-336-6459       wed     10:50            19

       ReasonForCall AnsweringAgent
0    Product Inquiry        Cameron
1          Complaint        Cameron
2  Technical Support        Kennedy
3  Technical Support           Lisa
4  Technical Support        Kennedy
(129588, 7)

### Q2 pg 14

In [7]:
import pandas as pd
from sqlalchemy import create_engine
# Connect to sqlite db
db_file = r'salesdata.db'
engine = create_engine(r"sqlite:///{}"
 .format(db_file))

In [8]:
sql = 'select name from sqlite_master'
name = pd.read_sql(sql, engine)
name

              name
0           scores
1  ix_scores_index

In [14]:
sql = 'SELECT * from scores limit 10'
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

   index  Sales Person  Intelligence  Extroversion  $ Sales/Week
0      0             1            89            21          2625
1      1             2            93            24          2700
2      2             3            91            21          3100
3      3             4           122            23          3150
4      4             5           115            27          3175
5      5             6           180            18          3100
6      6             7            98            19          2700
7      7             8           105            16          2475
8      8             9           112            23          3625
9      9            10           109            28          3525

## Assignment 3

### Q1 pg 25

In [10]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]
GradeList = zip(names,grades)
df = pd.DataFrame(data = GradeList,
columns=['Names', 'Grades'])
print(df)
df.loc[(df['Grades'] < 0,'Grades')] = 0
print("")
print("df after replacement")
print("")
print(df)

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

df after replacement

     Names  Grades
0      Bob      76
1  Jessica       0
2     Mary      77
3     John      78
4      Mel     101

## Assignment 4

### Q1 Pg 34

In [11]:
df = pd.read_csv("gradedata.csv")
print(df.head())
bins = [0, 79, 100]

group_names = ['Fail', 'Pass']
df['lettergrade'] = pd.cut(df['grade'], bins,labels=group_names)

     fname     lname  gender  age  exercise  hours  grade  \
0   Marcia      Pugh  female   17         3     10   82.4
1   Kadeem  Morrison    male   18         4      4   78.2
2     Nash    Powell    male   18         5      9   79.3
3  Noelani    Wagner  female   14         2      7   83.2
4  Noelani    Cherry  female   18         4     15   87.4

                                    address
0   9253 Richardson Road, Matawan, NJ 07747
1          33 Spring Dr., Taunton, MA 02780
2          41 Hill Avenue, Mentor, OH 44060
3        8839 Marshall St., Miami, FL 33125
4  8304 Charles Rd., Lewis Center, OH 43035

In [12]:
print(df.head())

     fname     lname  gender  age  exercise  hours  grade  \
0   Marcia      Pugh  female   17         3     10   82.4
1   Kadeem  Morrison    male   18         4      4   78.2
2     Nash    Powell    male   18         5      9   79.3
3  Noelani    Wagner  female   14         2      7   83.2
4  Noelani    Cherry  female   18         4     15   87.4

                                    address lettergrade
0   9253 Richardson Road, Matawan, NJ 07747        Pass
1          33 Spring Dr., Taunton, MA 02780        Fail
2          41 Hill Avenue, Mentor, OH 44060        Pass
3        8839 Marshall St., Miami, FL 33125        Pass
4  8304 Charles Rd., Lewis Center, OH 43035        Pass

### Q2 37

In [13]:
df['timemgmt'] = np.where((df['exercise']>3)
 & (df['grade'] > 17),'busy', 'not busy')
print(df.head(10))

     fname     lname  gender  age  exercise  hours  grade  \
0   Marcia      Pugh  female   17         3     10   82.4
1   Kadeem  Morrison    male   18         4      4   78.2
2     Nash    Powell    male   18         5      9   79.3
3  Noelani    Wagner  female   14         2      7   83.2
4  Noelani    Cherry  female   18         4     15   87.4
5     Neil   Whitley    male   16         5     16   88.7
6    Nelle    Golden  female   17         1      9   80.2
7  Armando   Hoffman    male   17         5     18   95.1
8  Illiana     Rojas  female   15         5      9   76.5
9     Neil    Wooten    male   15         3     15   89.7

                                    address lettergrade  timemgmt
0   9253 Richardson Road, Matawan, NJ 07747        Pass  not busy
1          33 Spring Dr., Taunton, MA 02780        Fail      busy
2          41 Hill Avenue, Mentor, OH 44060        Pass      busy
3        8839 Marshall St., Miami, FL 33125        Pass  not busy
4  8304 Charles Rd., Lewis Center, OH 43035        Pass      busy
5  40 Washington Ave., Bloomfield, NJ 07003        Pass      busy
6     9768 Hanover Dr., Meadville, PA 16335        Pass  not busy
7     360 Manor Drive, Northville, MI 48167        Pass      busy
8  9425 Studebaker Dr., Thibodaux, LA 70301        Fail      busy
9   400 Bridge Court, Soddy Daisy, TN 37379        Pass  not busy